app/Controllers/administracion/sexo.php

SELECT *
FROM `sexo`
---
    public function inicio()
    {
        $session = session();
        if (!$session->get('usuario')){
            return redirect()->route('/');
        }
        $sexoModel = model(SexoModel::class);
        $datos = array(
            "todos" => $sexoModel->findAll(),
            "menu" => menu(),
        );